DataProcessors/ТЗ_ИндивидуальныеПриказыНаПремию1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТЗ_ИндивидуальныеПриказыНаПремию1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументПремия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТЗ_Премия1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТЗ_КадроваяИстория1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТЗ_КадроваяИстория1</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЗ_Должности1</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЗ_Подразделения1</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЗ_Сотрудники1</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ТЗ_Премия1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТЗ_Премия1</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЗ_Организации1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Премии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТЗ_Сотрудники1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПремии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТЗ_ВидыПремий1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ТЗ_ИндивидуальныеПриказыНаПремию1/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДокументПремияПриИзменении(Элемент)
	
	ОбновитьСписокСотрудниковНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьСписокСотрудниковНаСервере()

	Сотрудники.Очистить();

	Если Не ЗначениеЗаполнено(Объект.ДокументПремия) Тогда
		Возврат;
	КонецЕсли;

	Если Не Объект.ДокументПремия.Проведен Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Премии.Сотрудник КАК Сотрудник,
	|	Премии.Сотрудник.Наименование КАК ФИО,
	|	Премии.Сотрудник.ТабельныйНомер КАК ТабельныйНомер,
	|	КадроваяИстория.Должность КАК Должность,
	|	КадроваяИстория.Подразделение КАК Подразделение,
	|	СУММА(Премии.Сумма) КАК СуммаПремии
	|ИЗ
	|	Документ.ТЗ_Премия1.Премии КАК Премии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТЗ_КадроваяИстория1.СрезПоследних(
	|			&ДатаДокумента
	|		) КАК КадроваяИстория
	|		ПО Премии.Сотрудник = КадроваяИстория.Сотрудник
	|
	|ГДЕ
	|	Премии.Ссылка = &ДокументПремия
	|
	|СГРУППИРОВАТЬ ПО
	|	Премии.Сотрудник,
	|	Премии.Сотрудник.Наименование,
	|	Премии.Сотрудник.ТабельныйНомер,
	|	КадроваяИстория.Должность,
	|	КадроваяИстория.Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИО";

	Запрос.УстановитьПараметр(
		"ДокументПремия",
		Объект.ДокументПремия
	);

	Запрос.УстановитьПараметр(
		"ДатаДокумента",
		Объект.ДокументПремия.Дата
	);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НоваяСтрока = Сотрудники.Добавить();

		НоваяСтрока.Выбран = Ложь;
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ФИО = Выборка.ФИО;
		НоваяСтрока.ТабельныйНомер = Выборка.ТабельныйНомер;
		НоваяСтрока.Должность = Выборка.Должность;
		НоваяСтрока.Подразделение = Выборка.Подразделение;
		НоваяСтрока.СуммаПремии = Выборка.СуммаПремии;

	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсех(Команда)

	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		СтрокаСотрудника.Выбран = Истина;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура СнятьВыбор(Команда)

	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		СтрокаСотрудника.Выбран = Ложь;
	КонецЦикла;

КонецПроцедуры


&НаСервере
Функция СформироватьПриказНаСервере(Сотрудник)

	ТабДок = Новый ТабличныйДокумент;

	ОбработкаОбъект =
		РеквизитФормыВЗначение("Объект");

	Макет =
		ОбработкаОбъект.ПолучитьМакет(
			"ТЗ_ПриказНаПремию"
		);

	ДокументПремия =
		Объект.ДокументПремия;


	// Получаем кадровые данные сотрудника
	// на дату документа премии

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КадроваяИстория.Должность КАК Должность,
	|	КадроваяИстория.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.ТЗ_КадроваяИстория1.СрезПоследних(
	|		&ДатаДокумента,
	|		Сотрудник = &Сотрудник
	|	) КАК КадроваяИстория";

	Запрос.УстановитьПараметр(
		"ДатаДокумента",
		ДокументПремия.Дата
	);

	Запрос.УстановитьПараметр(
		"Сотрудник",
		Сотрудник
	);

	ВыборкаКадровыхДанных =
		Запрос.Выполнить().Выбрать();

	Должность = Неопределено;
	Подразделение = Неопределено;

	Если ВыборкаКадровыхДанных.Следующий() Тогда

		Должность =
			ВыборкаКадровыхДанных.Должность;

		Подразделение =
			ВыборкаКадровыхДанных.Подразделение;

	КонецЕсли;


	// Шапка

	ОбластьШапка =
		Макет.ПолучитьОбласть("Шапка");

	ТабДок.Вывести(ОбластьШапка);


	// Данные сотрудника

	ОбластьДанные =
		Макет.ПолучитьОбласть("ДанныеСотрудника");

	ОбластьДанные.Параметры.ФИО =
		Сотрудник.Наименование;

	ОбластьДанные.Параметры.ТабельныйНомер =
		Сотрудник.ТабельныйНомер;

	ОбластьДанные.Параметры.Должность =
		Должность;

	ОбластьДанные.Параметры.Подразделение =
		Подразделение;

	ТабДок.Вывести(ОбластьДанные);


	// Заголовок таблицы премий

	ОбластьЗаголовок =
		Макет.ПолучитьОбласть("ЗаголовокПремий");

	ТабДок.Вывести(ОбластьЗаголовок);


	// Получаем премии конкретного сотрудника

	ЗапросПремий = Новый Запрос;

	ЗапросПремий.Текст =
	"ВЫБРАТЬ
	|	Премии.ВидПремии КАК ВидПремии,
	|	Премии.Сумма КАК Сумма
	|ИЗ
	|	Документ.ТЗ_Премия1.Премии КАК Премии
	|ГДЕ
	|	Премии.Ссылка = &ДокументПремия
	|	И Премии.Сотрудник = &Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Премии.НомерСтроки";

	ЗапросПремий.УстановитьПараметр(
		"ДокументПремия",
		ДокументПремия
	);

	ЗапросПремий.УстановитьПараметр(
		"Сотрудник",
		Сотрудник
	);

	ВыборкаПремий =
		ЗапросПремий.Выполнить().Выбрать();

	ИтоговаяСумма = 0;


	// Строки премий

	Пока ВыборкаПремий.Следующий() Цикл

		ОбластьПремия =
			Макет.ПолучитьОбласть("СтрокаПремии");

		ОбластьПремия.Параметры.ВидПремии =
			ВыборкаПремий.ВидПремии;

		ОбластьПремия.Параметры.Сумма =
			Формат(
				ВыборкаПремий.Сумма,
				"ЧДЦ=2"
			);

		ИтоговаяСумма =
			ИтоговаяСумма
			+ ВыборкаПремий.Сумма;

		ТабДок.Вывести(ОбластьПремия);

	КонецЦикла;


	// Итог

	ОбластьИтого =
		Макет.ПолучитьОбласть("Итого");

	ОбластьИтого.Параметры.ИтоговаяСумма =
		Формат(
			ИтоговаяСумма,
			"ЧДЦ=2"
		);

	ТабДок.Вывести(ОбластьИтого);


	// Подписи

	ОбластьПодписи =
		Макет.ПолучитьОбласть("Подписи");

	ОбластьПодписи.Параметры.Руководитель =
		ДокументПремия.Организация.Руководитель;

	ОбластьПодписи.Параметры.Сотрудник =
		Сотрудник.Наименование;

	ТабДок.Вывести(ОбластьПодписи);


	// Настройки табличного документа

	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьСетку = Ложь;

	Возврат ТабДок;

КонецФункции


&НаСервере
Процедура СохранитьПриказВФайлНаСервере(
	Сотрудник,
	ИмяФайла)

	КлючФайла =
		Строка(Объект.ДокументПремия)
		+ "|"
		+ Строка(Сотрудник);

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Файл.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТЗ_ПрисоединенныеФайлы КАК Файл
	|ГДЕ
	|	Файл.КлючФайла = &КлючФайла";

	Запрос.УстановитьПараметр(
		"КлючФайла",
		КлючФайла
	);

	Выборка =
		Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		ФайлОбъект =
			Выборка.Ссылка.ПолучитьОбъект();

	Иначе

		ФайлОбъект =
			Справочники.ТЗ_ПрисоединенныеФайлы.СоздатьЭлемент();

		ФайлОбъект.ДокументПремия =
			Объект.ДокументПремия;

		ФайлОбъект.Сотрудник =
			Сотрудник;

		ФайлОбъект.КлючФайла =
			КлючФайла;

	КонецЕсли;

	ФайлОбъект.Наименование =
		ИмяФайла;

	ФайлОбъект.ИмяФайла =
		ИмяФайла;

	ФайлОбъект.Записать();

	Сообщить(
		"Запись файла создана: "
		+ ИмяФайла
	);

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)

	ЕстьВыбранныеСотрудники = Ложь;

	Для Каждого СтрокаСотрудника Из Сотрудники Цикл

		Если Не СтрокаСотрудника.Выбран Тогда
			Продолжить;
		КонецЕсли;

		ЕстьВыбранныеСотрудники = Истина;

		Попытка

			ТабличныйДокумент =
				СформироватьПриказНаСервере(
					СтрокаСотрудника.Сотрудник
				);

			Если ТабличныйДокумент = Неопределено Тогда

				Сообщить(
					СтрокаСотрудника.ФИО
					+ " — не удалось сформировать приказ."
				);

				Продолжить;

			КонецЕсли;

			ТабличныйДокумент.Показать();

		Исключение

			Сообщить(
				СтрокаСотрудника.ФИО
				+ " — ошибка формирования: "
				+ ОписаниеОшибки()
			);

		КонецПопытки;

	КонецЦикла;


	Если Не ЕстьВыбранныеСотрудники Тогда

		Сообщить(
			"Не выбран ни один сотрудник."
		);

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СохранитьПриказы(Команда)

	ЕстьВыбранныеСотрудники = Ложь;

	КоличествоУспешно = 0;
	КоличествоОшибок = 0;

	Для Каждого СтрокаСотрудника Из Сотрудники Цикл

		Если Не СтрокаСотрудника.Выбран Тогда
			Продолжить;
		КонецЕсли;

		ЕстьВыбранныеСотрудники = Истина;

		Попытка

			ИмяФайла =
				"Приказ_"
				+ СтрокаСотрудника.ТабельныйНомер
				+ ".pdf";

			СохранитьПриказВФайлНаСервере(
				СтрокаСотрудника.Сотрудник,
				ИмяФайла
			);

			КоличествоУспешно =
				КоличествоУспешно + 1;

			Сообщить(
				СтрокаСотрудника.ФИО
				+ " — успешно."
			);

		Исключение

			КоличествоОшибок =
				КоличествоОшибок + 1;

			Сообщить(
				СтрокаСотрудника.ФИО
				+ " — ошибка: "
				+ ОписаниеОшибки()
			);

		КонецПопытки;

	КонецЦикла;


	Если Не ЕстьВыбранныеСотрудники Тогда

		Сообщить(
			"Не выбран ни один сотрудник."
		);

		Возврат;

	КонецЕсли;


	Сообщить(
		"Обработка завершена. "
		+ "Успешно: "
		+ КоличествоУспешно
		+ ". Ошибок: "
		+ КоличествоОшибок
		+ "."
	);

КонецПроцедуры
